src/test/artillery/loadTestConfig.yml
config:
  headers:
    Cookie: "Idea-a1c06431=606b0e24-777b-4c2b-b895-1a5f10246830; _pk_id.1.1fff=c62b47a6c4bd4378.1672401601.; _ym_uid=1673210414938100896; _ym_d=1673210414; Idea-a1c06432=e3f95848-edc4-4d52-9d85-a29137dd1fb2; _ym_isad=1; JSESSIONID=76B0D43273E252BC72390E6A73E2DD5A"
  target: 'http://localhost:8080'
  phases:
    - duration: 10
      arrivalRate: 100
#      arrivalCount: 10
#      rampTo: 3000
scenarios:
  - name: "Test pages"
    flow:
      - get:
          url: "/tasks/new"
      - get:
          url: "/tasks"
      - get:
          url: "/prediction"
      - get:
          url: "/roles"
      - get:
          url: "/screenplay"


#      name: Warm up
#    - duration: 120
#      arrivalRate: 5
#      rampTo: 50
#      name: Ramp up load
#    - duration: 600
#      arrivalRate: 50
#      name: Sustained load